In [1]:
import pandas as pd
import numpy as np

In [117]:
df = pd.read_csv('Amazon product data')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1503384 entries, 0 to 1503383
Data columns (total 9 columns):
salesRank      1422273 non-null object
brand          97407 non-null object
categories     1503384 non-null object
related        1057123 non-null object
asin           1503384 non-null object
title          1502696 non-null object
price          574882 non-null float64
imUrl          1503305 non-null object
description    84781 non-null object
dtypes: float64(1), object(8)
memory usage: 103.2+ MB

In [4]:
sales = pd.read_csv("Sales.csv")

In [5]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001533 entries, 0 to 1001532
Data columns (total 4 columns):
Unnamed: 0    1001533 non-null int64
0             1001533 non-null object
1             646136 non-null object
2             444130 non-null object
dtypes: int64(1), object(3)
memory usage: 30.6+ MB

In [115]:
sales.head()

,also_viewed,bought_together,also_bought,rank
0,"'B00JO8II76', 'B00DGN4R1Q', 'B00E1YRI4C'",NaN,NaN,1233557
1,"'B00E1YRI4C', 'B00D23MC6W', 'B00AFDOPDA', 'B00...",'B00D23MC6W',"'0000031852', '0000031895', '0000031909', 'B00...",8547
2,"'B0006JCGUM', 'B000BMTCK6', 'B00194Q262', 'B00...","'B000BMTCK6', 'B0006JCGUM'","'B000BMTCK6', 'B0006JCGUM', 'B00194Q262', 'B00...",16987
3,"'B008MTRT1O', 'B00BUG47S4', 'B00GTVY0DC', 'B00...",NaN,NaN,1180499
4,"'B00A6JD8EA', 'B00BFL4FTA', 'B00JPI9AAO', 'B00...",NaN,NaN,1038084

In [6]:
df["product_name"] = df["title"]
df["product_id"] = df["asin"]
df = df.drop(["imUrl","description","title","asin","related","brand"], axis = 1)

In [116]:
df.head()

,product_name,product_id,item_price,also_viewed,bought_together,also_bought,rank
826936,U.S. Polo Assn. Sport Men's US9061 Watch with ...,B008D902Q2,1385.37,"'B00E955EOO', 'B00DJ242ZK', 'B00AFXL15A', 'B00...","'B00E955EOO', 'B00DJ242ZK', 'B00J2L4EUA', 'B00...","'B00E955EOO', 'B00DJ242ZK', 'B00ENG7WGC', 'B00...",1
583,Converse Unisex Chuck Taylor Classic Colors Sn...,B000072UN4,NaN,'B001IX6F1G',"'B001IX6F1G', 'B009ZPWMIE'",NaN,10
591,Converse Unisex Chuck Taylor Classic Colors Sn...,B000072UN1,NaN,"'B005BMCKVE', 'B0000AS4YH', 'B005BMEJCW', 'B00...",'B000VHW3M0',NaN,10
594,Converse Unisex Chuck Taylor Classic Colors Sn...,B000072UMJ,NaN,"'B000AP4ZZG', 'B000APACVW', 'B008LQR36O', 'B00...","'B000APACVW', 'B000AP4ZZG', 'B008LQR36O', 'B00...","'B000APACVW', 'B008LQR36O', 'B000AP4ZZG', 'B00...",10
425689,Wholesale Lot of 50Pc 14G Belly Button Navel R...,B004HWZLBA,116.55,"'B00A3S40Z0', 'B00B4022II', 'B00AWP6BGU', 'B00...","'B00A3S40Z0', 'B00B4022II', 'B00BXF2CJS', 'B00...","'B00BXF2CJS', 'B00B4022II', 'B00A3S40Z0', 'B00...",10

In [118]:
rank = df

In [ ]:
rank = df['salesRank'].apply(lambda x: pd.Series(str(x).split(':')))

In [12]:
sales = sales.drop(["Unnamed: 0"], axis = 1)
sales.head()

,0,1,2
0,"{'also_viewed': ['B00JO8II76', 'B00DGN4R1Q', '...",NaN,NaN
1,"{'also_viewed': ['B00E1YRI4C', 'B00D23MC6W', '...",'bought_together': ['B00D23MC6W',"'also_bought': ['0000031852', '0000031895', '..."
2,"{'also_viewed': ['B0006JCGUM', 'B000BMTCK6', '...","'bought_together': ['B000BMTCK6', 'B0006JCGUM'","'also_bought': ['B000BMTCK6', 'B0006JCGUM', '..."
3,"{'also_viewed': ['B008MTRT1O', 'B00BUG47S4', '...",NaN,NaN
4,"{'also_viewed': ['B00A6JD8EA', 'B00BFL4FTA', '...",NaN,NaN

In [15]:
bought_together = sales['1'].apply(lambda x: pd.Series(str(x).split(': [')))

In [16]:
also_viewed = sales['0'].apply(lambda x: pd.Series(str(x).split(': [')))

In [17]:
also_bought = sales['2'].apply(lambda x: pd.Series(str(x).split(': [')))

In [25]:
sales['also_viewed'] = also_viewed[1]
sales['bought_together'] = bought_together[1]
sales['also_bought'] = also_bought[1]

In [26]:
# sales = sales.join(also_viewed)
# sales = sales.join(bought_together)
# sales = sales.join(also_bought)
# sales = sales.drop(["0","1","2"], axis = 1)
sales = sales.replace({']}': ''}, regex=True)

In [29]:
sales.head()

,also_viewed,bought_together,also_bought
0,"'B00JO8II76', 'B00DGN4R1Q', 'B00E1YRI4C'",NaN,NaN
1,"'B00E1YRI4C', 'B00D23MC6W', 'B00AFDOPDA', 'B00...",'B00D23MC6W',"'0000031852', '0000031895', '0000031909', 'B00..."
2,"'B0006JCGUM', 'B000BMTCK6', 'B00194Q262', 'B00...","'B000BMTCK6', 'B0006JCGUM'","'B000BMTCK6', 'B0006JCGUM', 'B00194Q262', 'B00..."
3,"'B008MTRT1O', 'B00BUG47S4', 'B00GTVY0DC', 'B00...",NaN,NaN
4,"'B00A6JD8EA', 'B00BFL4FTA', 'B00JPI9AAO', 'B00...",NaN,NaN

In [ ]:
rank = rank.replace({'}': ''}, regex=True)
rank = rank.replace({'{': ''}, regex=True)
rank.head()

In [33]:
rank["rank"] = rank[1]

In [36]:
rank = rank.drop([0,1], axis = 1)

In [49]:
rank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1503384 entries, 0 to 1503383
Data columns (total 1 columns):
rank    1421649 non-null object
dtypes: object(1)
memory usage: 11.5+ MB

In [37]:
sales = sales.join(rank)

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1503384 entries, 0 to 1503383
Data columns (total 5 columns):
salesRank       1422273 non-null object
categories      1503384 non-null object
price           574882 non-null float64
product_name    1502696 non-null object
product_id      1503384 non-null object
dtypes: float64(1), object(4)
memory usage: 57.3+ MB

In [41]:
df = df.drop(["salesRank","categories"],axis=1)

In [43]:
df["item_price"] = 63*df["price"]

In [45]:
df = df.drop(["price"],axis=1)

In [46]:
df = df.join(sales)
df = df.join(rank)
new_df = df.sort_values("rank")

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1503384 entries, 826936 to 1503383
Data columns (total 7 columns):
product_name       1502696 non-null object
product_id         1503384 non-null object
item_price         574882 non-null float64
also_viewed        1001533 non-null object
bought_together    646136 non-null object
also_bought        444130 non-null object
rank               942872 non-null object
dtypes: float64(1), object(6)
memory usage: 91.8+ MB

In [110]:
df.head()

,product_name,product_id,item_price,also_viewed,bought_together,also_bought,rank
826936,U.S. Polo Assn. Sport Men's US9061 Watch with ...,B008D902Q2,1385.37,"'B00E955EOO', 'B00DJ242ZK', 'B00AFXL15A', 'B00...","'B00E955EOO', 'B00DJ242ZK', 'B00J2L4EUA', 'B00...","'B00E955EOO', 'B00DJ242ZK', 'B00ENG7WGC', 'B00...",1
583,Converse Unisex Chuck Taylor Classic Colors Sn...,B000072UN4,NaN,'B001IX6F1G',"'B001IX6F1G', 'B009ZPWMIE'",NaN,10
591,Converse Unisex Chuck Taylor Classic Colors Sn...,B000072UN1,NaN,"'B005BMCKVE', 'B0000AS4YH', 'B005BMEJCW', 'B00...",'B000VHW3M0',NaN,10
594,Converse Unisex Chuck Taylor Classic Colors Sn...,B000072UMJ,NaN,"'B000AP4ZZG', 'B000APACVW', 'B008LQR36O', 'B00...","'B000APACVW', 'B000AP4ZZG', 'B008LQR36O', 'B00...","'B000APACVW', 'B008LQR36O', 'B000AP4ZZG', 'B00...",10
425689,Wholesale Lot of 50Pc 14G Belly Button Navel R...,B004HWZLBA,116.55,"'B00A3S40Z0', 'B00B4022II', 'B00AWP6BGU', 'B00...","'B00A3S40Z0', 'B00B4022II', 'B00BXF2CJS', 'B00...","'B00BXF2CJS', 'B00B4022II', 'B00A3S40Z0', 'B00...",10

In [114]:
df.to_csv("Cleaned_data.csv")